[
  {
    "id": 1,
    "name": "1984",
    "author": "George Orwell",
    "book_cover": "https://upload.wikimedia.org/wikipedia/commons/c/c3/1984first.jpg",
    "topics": [
      {
        "name": "Dystopia",
        "content": "Orwell’s *1984* paints a harrowing vision of a dystopian future where the totalitarian Party dominates every aspect of life in Oceania. Society is stripped of individuality, free thought, and privacy. Citizens are monitored 24/7 by telescreens and the Thought Police, while historical records are continuously rewritten to align with the Party’s propaganda..."
      },
      {
        "name": "Totalitarianism",
        "content": "The Party’s absolute control over Oceania exemplifies totalitarianism. Leaders enforce loyalty through fear, propaganda, and the elimination of dissent. Concepts like 'doublethink' (holding two contradictory beliefs simultaneously) and 'thoughtcrime' (illegal rebellious thoughts) are tools to suppress individuality..."
      },
      {
        "name": "Surveillance",
        "content": "Surveillance in *1984* is omnipresent and inescapable. Telescreens in every home and public space broadcast Party propaganda while spying on citizens. The Thought Police infiltrate daily life, punishing even subtle facial expressions that hint at dissent..."
      }
    ],
    "content": "George Orwell’s *1984* is a seminal dystopian novel set in a grim future where the totalitarian Party governs Oceania with absolute control. Winston Smith, a low-ranking bureaucrat, secretly rebels against the regime by keeping a forbidden diary and pursuing a clandestine relationship with Julia, a fellow dissenter..."
  },
  {
    "id": 2,
    "name": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "book_cover": "https://upload.wikimedia.org/wikipedia/commons/4/4f/To_Kill_a_Mockingbird_%28first_edition_cover%29.jpg",
    "topics": [
      {
        "name": "Racial Injustice",
        "content": "Set in 1930s Alabama, *To Kill a Mockingbird* confronts systemic racism through the trial of Tom Robinson, a Black man falsely accused of raping Mayella Ewell. Atticus Finch’s defense of Tom exposes the jury’s ingrained prejudice..."
      },
      {
        "name": "Morality",
        "content": "Atticus Finch emerges as the moral backbone of the story, teaching Scout and Jem that courage means 'doing what’s right even when you know you’ll lose.' His defense of Tom Robinson, despite threats from the townspeople, underscores his commitment to justice..."
      },
      {
        "name": "Childhood",
        "content": "Scout’s narration captures the loss of innocence as she navigates a world rife with racism and cruelty. Early scenes of carefree play with Jem and Dill contrast sharply with the trial’s brutality and Bob Ewell’s vengeful attack..."
      }
    ],
    "content": "Harper Lee’s *To Kill a Mockingbird* is a poignant exploration of racial injustice and moral growth in the Depression-era South. Through the eyes of Scout Finch, a precocious six-year-old, the novel chronicles her father Atticus’s defense of Tom Robinson, a Black man falsely accused of rape..."
  },
  {
    "id": 3,
    "name": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "book_cover": "https://upload.wikimedia.org/wikipedia/en/4/4a/TheHobbit_FirstEdition.jpg",
    "topics": [
      {
        "name": "Adventure",
        "content": "Bilbo Baggins’ journey from the comfort of the Shire to the treacherous Lonely Mountain epitomizes the hero’s adventure. Accompanied by Gandalf the wizard and 13 dwarves led by Thorin Oakenshield, Bilbo confronts trolls, goblins, giant spiders, and the dragon Smaug..."
      },
      {
        "name": "Fantasy",
        "content": "Tolkien’s Middle-earth is a richly imagined fantasy world teeming with magical creatures and ancient lore. From the Elven kingdom of Rivendell to the dark depths of Mirkwood Forest, the novel introduces iconic elements like the One Ring..."
      },
      {
        "name": "Heroism",
        "content": "Bilbo’s heroism defies traditional warrior tropes. Unlike Thorin, who seeks glory and treasure, Bilbo relies on wit, compassion, and luck. He saves the dwarves from spiders using Sting (his sword) and trickery..."
      }
    ],
    "content": "J.R.R. Tolkien’s *The Hobbit* is a whimsical yet epic fantasy chronicling Bilbo Baggins’ unexpected journey to reclaim the dwarves’ homeland from the dragon Smaug. Reluctantly recruited by Gandalf, Bilbo leaves his cozy hobbit hole to join Thorin Oakenshield’s quest for the Lonely Mountain..."
  }
]
